[
  {
    "topic": "Forretningsområde", 
    "category": "Forretningsutvikling", 
    "text": "Spesialkompetanse innen et eller flere områder en forretningsvirksomhet består av. Det kan være generelle områder som økonomi, HR, logistikk, M&amp;A, innkjøp, etc. Det kan være bransjespesifikke områder som f.eks. billettering, inntektsoptimalisering osv. Eller det kan være meta-områder som ser på organisasjonsdesign, organisasjonsmodeller, styringsmodeller, verdikonfigurasjoner, koordinerings- og kontrollmekanismer, styringsprosesser, samhandlingsarkitekturer, forretningsmodeller mm."
  }, 
  {
    "topic": "Grafisk/Visuelt design", 
    "category": "Brukeropplevelse og design", 
    "text": "Digitale medier, print, typografi, universell utforming, infographics, illustrasjon, identity, branding, guidelines, piktogram / ikon design, fargestyring, animasjon / motion graphics."
  }, 
  {
    "topic": "Business intelligence og strategi", 
    "category": "Brukeropplevelse og design", 
    "text": "Bygge skreddersydde analyseløsninger, dashboards, rapporterter og analyser. I tillegg til ren forretningsutvikling som er de praktiske elementene de sedvanlige rapporterings- og dashboard-produktene som AWS QuickSight og tilsvarende."
  }, 
  {
    "topic": "Produkteierskap", 
    "category": "Forretningsutvikling", 
    "text": "Ansvar for å oppdatere og prioritere produktkø på vegne av kunde. Gir myndighet til å ta avgjørelser som påvirker innholdet og økonom. Krever inngående kjennskap til produktet og behov for å jobbe tett med utviklingsteamet"
  }, 
  {
    "topic": "Cognitive computing", 
    "category": "Brukeropplevelse og design", 
    "text": "Vi bruker dette som fellesbetegnelse for alt som omfatter maskinlæring og kunstig intelligens. Design, utvikling, testing, vedlikehold, dokumentasjon og forvaltning av maskinlæringsmodeller. AI, ML, data pipelines, A/B-testing, bygge algoritmer/modeller. Stikkord: Apache Spark, R, Python, statistisk analyse, stordata-analyse, Python Numpy, Python Pandas. etc."
  }, 
  {
    "topic": "Research", 
    "category": "Brukeropplevelse og design", 
    "text": "Research området inneholder observasjon av brukere, kartlegging av kundereiser, brukertesting og annet innsiktsarbeid. Videre må man gjennomføre analyse samt rapportere resultatene fra disse aktivitetene."
  }, 
  {
    "topic": "Smidige metoder og samarbeid", 
    "category": "Systemutvikling", 
    "text": "Kunnskap om og evne til å benytte smidige teknikker, kommunikasjon og håndtering av kunder og brukere. F.eks. Scrum, Kanban, XP, parprogrammering, code-review, kanban-board, sprint, demo, retrospektiver, MVP, iterativ utvikling, standup-møter. Effektiv bruk av kommunikasjonsverktøy som mail og chat. Avklaringer og dokumentasjon. Overordnet problemløsning, krisehåndtering og feilsøking. Estimering, planlegging og rapportering. Delegering og ansvarsfordeling."
  }, 
  {
    "topic": "Tjenestedesign", 
    "category": "Brukeropplevelse og design", 
    "text": "Konseptutvikling, prototyping, brukerreise."
  }, 
  {
    "topic": "Lean Startup", 
    "category": "Metode, prosess og ledelse", 
    "text": "Erfaring med bruk av Lean Startup metodikken utviklet av Eric Ries. Erfaring med utvikling av MVP, fokus på validated learning og bruk av hyppige iterasjoner i prototype- og innovasjonsfasen i produktutvikling, mv."
  }, 
  {
    "topic": "Serverless", 
    "category": "Skyteknologi", 
    "text": "Serverless er et kryss-plattform rammeverk for å rulle ut funksjoner på mange forskjellige plattformer. I tillegg til de store plattformene (AWS, Azure, GCP) støtter også Serverless framework kubernetes-baserte FaaS-løsninger som Kubeless."
  }, 
  {
    "topic": "Lagrings- og integrasjonsløsninger", 
    "category": "Systemutvikling", 
    "text": "Kunnskap om løsninger for lagring, integrasjon og søk. Eks. Relasjonsdatabaser (PostgreSQL, Oracle, SQLServer, Derby etc.), NoSQL-løsninger (Cassandra, AWS S3 etc.). Spørrespråk og rammeverk oppå disse (SQL, GraphQL, Hibernate, LINQ, JDBC etc.), Søkeløsninger (Elasticsearch, Solr etc.), Integrasjonsløsninger som Kafka, MQTT, JMS, ActiveMQ, RabbitMQ etc."
  }, 
  {
    "topic": "Kubernetes", 
    "category": "Skyteknologi", 
    "text": "Kubernetes er rammeverk som gir deg mulighet til å realisere sky-uavhengighet. I hovedsak er Kubernetes en hostet tjeneste og her snakker vi først og fremst om bruk av GKE, EKS og AKS - hhv. Google, AWS og Azure sine PaaS-platformer som tilbyr Kubernetes. For full score her kreves det inngående kunnskap om alle deler av Kubernetes - også utvidelser av Kubernetes med custom controllere og CRD’er."
  }, 
  {
    "topic": "Distribuert databehandling", 
    "category": "Brukeropplevelse og design", 
    "text": "Designe og implementere infrastruktur og plattformer i skyen. Data pipelines for prosessering av store mengder data. Relevante teknologier er Apache Airflow, Argo Workflows, AWS Step functions, Google Cloud Composer (hosted Airflow)."
  }, 
  {
    "topic": "Porteføljestyring", 
    "category": "Metode, prosess og ledelse", 
    "text": "Erfaring med å koordinere og prioritere parallelle produkt- og tjenesteutviklingsløp i sammenheng. Evne til å se konsekvensen av, og forstå risiko ved, forretningsmessige, økonomiske, strategiske og personalmessige prioriteringer på tvers. Erfaring med ROS-analyse (Risiko og sårbarhet), SWOT (Strength, Weakness, Opportunities and Threats) og Gap analyse. Evne til å forstå, visualisere og kommunisere kompliserte oversikter og sammenhenger."
  }, 
  {
    "topic": "AWS", 
    "category": "Skyteknologi", 
    "text": "AWS har et omfattende sett av skytjenester. For grunnleggende bruk kreves innsikt til den grunnleggende tilgangskontrollen (IAM). Ingen forventes å kjenne til alle de hundrevis av tjenester og funksjoner som er tilgjengelig på plattformen."
  }, 
  {
    "topic": "Edge computing", 
    "category": "IoT, mikrokontrollere og elektronikk", 
    "text": ""
  }, 
  {
    "topic": "Data engineering og data warehousing", 
    "category": "Brukeropplevelse og design", 
    "text": "Håndtering av datakilder, -struktur, -kvalitet, og -lagring, tilgjengeliggjøring og transformasjon til et nyttig format for analyser. Data history for å kunne spore dataens opphav."
  }, 
  {
    "topic": "Sky-orkestrering / gitops / Infrastructure as Code", 
    "category": "Skyteknologi", 
    "text": "I en ideell virkelighet skal en kunne trykke på en knapp og rulle ut en hel løsning automatisk. Dette kan realiseres med verktøy som Terraform eller Pulumi som kan ha sin kode i Git."
  }, 
  {
    "topic": "Sikkerhet", 
    "category": "Systemutvikling", 
    "text": "Kunnskap om hvordan man utvikler sikre datasystemer, og om vanlige sårbarheter og hvordan man unngår dem. Eks: Autentiserings- og autoriseringsprotokoller (OpenID Connect, SAML, Kerberos, JWT etc), Metoder (Vulnerability scanning, Penetration testing, Risikoanalyse, Audits, m.m.), Sårbarheter (XSS, CSRF, SQL Injection, OWASP top 10, m.m.), Kryptering, hashing og nøkkelhåndtering"
  }, 
  {
    "topic": "Data mining og statistisk analyse", 
    "category": "Brukeropplevelse og design", 
    "text": "Oversette et forretningsproblem til et dataspørsmål, lage prediktive modeller som svarer på spørsmålet og forteller historien om funnene."
  }, 
  {
    "topic": "Dataplattform", 
    "category": "IoT, mikrokontrollere og elektronikk", 
    "text": ""
  }, 
  {
    "topic": "Sektor-/bransjeutvikling", 
    "category": "Forretningsutvikling", 
    "text": "Spesialkompetanse innen en eller flere sektorer/bransjer, og en forståelse for hvordan bransjen påvirkes og hvor den er på vei, forretningsmessig. Kjennskap til de sentrale aktører. Eksempler kan være offentlig sektor, mobilitet, bygg, mat, helse mm."
  }, 
  {
    "topic": "Markeds- eller driftsrelatert dataanalyse", 
    "category": "Brukeropplevelse og design", 
    "text": "Formålet med både markeds- og driftsrelatert dataanalyse er å følge med på hvordan det går og identifisere muligheter. Markedsrelatert data-analyse fokuserer på kunder og markeder, mens driftsrelatert dataanalyse kan være å optimalisere teknologi, logistikk, menneskelige ressurser og lignende."
  }, 
  {
    "topic": "Interaksjonsdesign", 
    "category": "Brukeropplevelse og design", 
    "text": "User stories, wireframes, informasjonsarkitektur, story-boards, Universell Utforming, prototyper."
  }, 
  {
    "topic": "Produktutvikling", 
    "category": "Metode, prosess og ledelse", 
    "text": "Lede planleggingen, prioriteringen og gjennomføring av produktutvikling. Forstå forretningsbehov og forretningsmodeller som grunnlag for produktplanleggingen og gjennomføring av utviklingen. Oversette forretningsbehov og brukerbehov til funksjonelle behov, og kommunisere dette til utviklingsteam og -ledere."
  }, 
  {
    "topic": "Salg", 
    "category": "Forretningsutvikling", 
    "text": "(tilbud, presale, avrop)"
  }, 
  {
    "topic": "Smidig Coaching", 
    "category": "Metode, prosess og ledelse", 
    "text": "Evne til å veilede team eller andre organisasjonsenheter i innføring eller forbedring av smidige prosesser, med fokus på å etablere riktig tankesett og konkrete smidige metoder og teknikker som hjelper enheten å lykkes bedre."
  }, 
  {
    "topic": "GCP", 
    "category": "Skyteknologi", 
    "text": "Se AWS"
  }, 
  {
    "topic": "Arkitektur og analyse", 
    "category": "Systemutvikling", 
    "text": "Kunnskap om innsamling og analysering av krav og behov til systemet, systematisering av disse, og design av arkitektur som løser de. Eks. funksjonelle og ikke-funksjonelle krav, nåværende og fremtidige krav med vekting av de forskjellige. Forskjellige innfallsvinkler til arkitektur, som systemarkitektur, løsningsarkitektur, sikkerhetsarkitektur, informasjonsarkitektur mm. Design og modellering av informasjon, internt og gjennom api-design."
  }, 
  {
    "topic": "Prosjektstyring og kontraktshåndtering", 
    "category": "Metode, prosess og ledelse", 
    "text": "Evne å håndtere planlegging og oppfølging av prosjekter med gitt scope og budsjett. Forståelse for de vanligste kontraktsformene ved prosjektgjennomføring, herunder varianter av Statens standardavtaler i flere generasjoner, samt forstå hvilke krav til endringshåndtering og dokumentasjon som følger av disse kontraktene."
  }, 
  {
    "topic": "Azure", 
    "category": "Skyteknologi", 
    "text": "Se AWS"
  }, 
  {
    "topic": "Mikrokontrollere", 
    "category": "IoT, mikrokontrollere og elektronikk", 
    "text": ""
  }, 
  {
    "topic": "Forretningsplaner", 
    "category": "Forretningsutvikling", 
    "text": "Forretningsutvikling handler om å se nye muligheter. Forretningsplan er en systematisk gjennomgang av forretningsider, grunnlaget for den enkelte og hvordan den skal settes ut i livet. Den skal ta for seg hvordan butikken skal drives, hvor mye og hvordan du skal hente, tjene og investere penger. Den er et styringsdokument for deg og bedriften, og brukes også mot banker, investorer, myndigheter mm, og foreligger typisk på strategisk, taktisk eller operativt nivå"
  }, 
  {
    "topic": "Drift og infrastruktur", 
    "category": "Systemutvikling", 
    "text": "Kunnskap om drift og infrastruktur. Eks.: Deployment pipelines, Continous Integration, Continous Deployment, oppsett av miljøer, scripting, overvåkning, LDAP og AD. Eksempler på teknologier: Ansible, Terraform, Pulomi, Docker, Kubernetes, Helm, Jenkins, Travis, Bamboo, Bash, Python, Grafana, DataDog, ELK (Elasticsearch, Kibana, Logstash) ."
  }, 
  {
    "topic": "Data visualisering og presentasjon", 
    "category": "Brukeropplevelse og design", 
    "text": "Vise frem og kommunisere dataene på en visuelt tiltalende måte. Mer grafisk orienterte oppgaver."
  }, 
  {
    "topic": "Teamledelse", 
    "category": "Metode, prosess og ledelse", 
    "text": "Kunne lede og koordinere arbeidet på et smidig utviklingsteam. Kjennskap til smidig metodikk og metodikk for smidig produktutvikling slik som Scrum, Kanban, Design Thinking, Lean Startup mv. Kjennskap til fasiliteringsteknikker. Kunne organisere og fasilitere kick-off, sprint planning, retrospectives, arbeidsmøter og idémyldringsaktiviteter mv."
  }, 
  {
    "topic": "Frontend", 
    "category": "Systemutvikling", 
    "text": "Kunnskap om utvikling, oppsett og utrulling av applikasjoner basert på web-teknologi. Eks. Plattform (JavaScript, HTML, CSS, Progressive Web Apps, Web Assembly, etc), Rammeverk (React, Angular, Vue, Svelte, Redux, D3, lodash, etc), Kodekvalitet/testing: (Eslint, Jest, Cypress, Prettier), byggverktøy (Npm, Yarn, Webpack, Babel, Typescript, Static site generators, etc), Kryssplattform (Electron, React Native, etc), Node.js (Server side rendering, dev server, proxying, cli scripting, etc).og tilsvarende teknologier og rammeverk."
  }, 
  {
    "topic": "Embedded IoT", 
    "category": "IoT, mikrokontrollere og elektronikk", 
    "text": ""
  }, 
  {
    "topic": "Prosessledelse", 
    "category": "Brukeropplevelse og design", 
    "text": "Kunde kommunikasjon, ledelse av designteam, Workshops, tilrettelegging"
  }, 
  {
    "topic": "Teknologiledelse og organisering", 
    "category": "Metode, prosess og ledelse", 
    "text": "Evne til å organisere en utviklingsavdeling, team, eller annen selvstendig ingeniør-, utviklings- eller innovasjonsenhet. Etablere styrings- og koordineringsrutiner på tvers av flere parallelle utviklingsløp med gjensidige avhengigheter. Legge til rette for hensiktsmessig organisering av anskaffelsesprosesser og sourcingstrategi for teknologianskaffelser. Legge til rette for hensiktsmessige utviklingsprosesser, med balansert fokus på hastighet, funksjonalitet, skalerbarhet, vedlikeholdbarhet og kvalitet."
  }, 
  {
    "topic": "Markedsutvikling", 
    "category": "Forretningsutvikling", 
    "text": "Markeder kommer og går. Ny teknologi er en viktig årsak til markedsendringer, men det finnes også andre forhold som forandrer et marked. Forståelse av trender, nye markeder, konkurrentanalyse, kundeportefølje, segmentanalyse, effekter av salg- og markedsføringsaktiviteter"
  }, 
  {
    "topic": "Strategisk ledelse", 
    "category": "Metode, prosess og ledelse", 
    "text": "Du er opptatt av å utvikle hele eller deler av en forretningsmessig enhet. Faget ditt er derfor forretning. Du har erfaring med å lede et selskap, eller en enhet på administrativt og overordnet (strategisk) nivå. Erfaring med å utforme, forankre og kommunisere selskapets visjon, målsettinger og strategi. For eksempel utarbeide forretningsplaner og forankre de med styret, ledergruppen og de ansatte."
  }, 
  {
    "topic": "Omdømme", 
    "category": "Forretningsutvikling", 
    "text": "Omdømme handler om hvilke meninger og forventninger omverdenen har til bedriften og det vi leverer. Typisk handler det om etikk, risiko, governance, og kommunikasjon."
  }, 
  {
    "topic": "Personalledelse", 
    "category": "Metode, prosess og ledelse", 
    "text": "Som personalleder er du opptatt av å utvikle andre, og bidra til at hver enkelt stadig blir en bedre versjon av seg selv. Dermed er det ikke ditt direkte bidrag som teller mest, men hva du klarer å få til gjennom andre, på vegne av fellesskapet. Faget ditt er derfor mennesker. Erfaring med å ha personalansvar for andre. Erfaring med medarbeidersamtaler, lønnsforhandlinger på vegne av arbeidsgiver, og personaloppfølging. Evne til å inspirere, motivere, forklare og ikke minst lytte. Kjennskap til arbeidsmiljøloven, personalhåndbok og fagforeningsvirksomhet. Bidra til at den man leder tar aktive valg om personlige utvikling, gjennom “personlig læringsstier”, og basert på egne ambisjoner og fellesskapets behov."
  }, 
  {
    "topic": "Mobil", 
    "category": "Systemutvikling", 
    "text": "Kunnskap om utvikling på iOS og Android-telefoner. Både native utvikling og hybride løsninger. For native: Kotlin (Android) og Swift (iOS). Koding av brukerintegrasjon med det native grafiske grensesnittet, REST API og CRUD mot lokal database (native SQlite-database med Core Data (iOS) og Room (Android)). Løsninger for skybackup, navigasjon mellom skjermbilder, push fra app-server, deling av data For hybrid: Xamarin, Flutter og React Native."
  }, 
  {
    "topic": "Test og kvalitet", 
    "category": "Systemutvikling", 
    "text": "Kunnskap om enhetstesting, integrasjonstesting, mocking og tilhørende verktøy og rammeverk (Mockito, Easymock, Junit, DbUnit). Oppsett av automatiske tester, gjerne via en CI/CD-pipeline. Gjennomføring av testløp for leveranser, herunder vurdering av testbehov og hvordan dette dekkes opp via automatiserte tester og manuelle tester."
  }, 
  {
    "topic": "Backend", 
    "category": "Systemutvikling", 
    "text": "Kunnskap om backend-utvikling og modellering. Eks. JVM (Java, Scala, Kotlin, etc), .Net (C#, F# etc), Systemspråk (C, C++, Rust, etc), Interpreterte språk (Javascript, Perl, Ruby, Python, etc), APIer (REST, SOAP, forskjellige typer RPC, etc), Strukturering og metodikk (Funksjonell programmering, Objektorientering, lagdeling, etc.). Design Patterns (Dependency Injection, Singleton, Factory Pattern, Observer Pattern , etc), Rammeverk og biblioteker (Spring, Koin, Scalatra, etc)"
  }
]